app/Controllers/AddCustomerController.php

    public function checkTc()
{
    $tc = $this->request->getPost('tc');

    if (!$tc || strlen($tc) != 11) {
        return $this->response->setJSON(['exists' => false]);
    }

    $model = new \App\Models\CustomerModel();

    $exists = $model
        ->where('tc', $tc)
        ->where('status', 'A')
        ->first();
---
SELECT *
FROM `customer`
WHERE `tc` = '38428987054'
AND `status` = 'A'
 LIMIT 1