app/Controllers/AddCustomerController.php

    public function customerview($id)
    {
        $customerModel = new \App\Models\CustomerModel();
        $customer = $customerModel->find($id); // id'ye göre müşteri verilerini al
---
SELECT *
FROM `customer`
WHERE `customer`.`id` = '1786'