app/Controllers/GrafikController.php

    public function index()
    {
        // UserModel'den isimleri alıyoruz
        $userModel = new UserModel();
        $users = $userModel->findAll();

        // CustomerModel'den ekleyen_id'ye göre gruplandırarak kayıt sayısını alıyoruz
        $customerModel = new CustomerModel();
        $customerCounts = $customerModel->select('ekleyen_id, COUNT(*) as count')
            ->where('status', 'A')
            ->groupBy('ekleyen_id')
            ->findAll();

        // Kullanıcı isimlerini ve karşılık gelen kayıt sayılarını hazırlıyoruz
        $names = [];
        $series = [];
        $thisMonthCounts = []; // Bu ay için yapılan kayıtları tutacak dizi

        foreach ($customerCounts as $count) {
            // Kullanıcı adını alıyoruz (ekleyen_id'ye göre)
            $user = $userModel->find($count['ekleyen_id']);
            if ($user) {
                $names[] = $user['name']; // Kullanıcı adını ekliyoruz
                $series[] = (int)$count['count'];  // Kullanıcıya ait toplam kayıt sayısını ekliyoruz

                // Bu ay için yapılan kayıt sayısını hesaplıyoruz
                $thisMonthCount = $customerModel->where('status', 'A')
                    ->where('ekleyen_id', $count['ekleyen_id'])
                    ->where('created_date >=', date('Y-m-01')) // Bu ayın ilk günü
                    ->where('created_date <=', date('Y-m-t')) // Bu ayın son günü
                    ->countAllResults(); // Kullanıcının bu ay yaptığı toplam kayıt sayısını alıyoruz
---
SELECT *
FROM `users`
SELECT `ekleyen_id`, COUNT(*) as count
FROM `customer`
WHERE `status` = 'A'
GROUP BY `ekleyen_id`
SELECT *
FROM `users`
WHERE `users`.`user_id` = '0'
SELECT COUNT(*) AS `numrows`
FROM `customer`
WHERE `status` = 'A'
AND `ekleyen_id` = '1'
AND `created_date` >= '2025-05-01'
AND `created_date` <= '2025-05-31'

        }

        // Ay bazında toplam kayıtları alıyoruz
        $monthlyCounts = $customerModel->select('MONTH(created_date) as month, COUNT(*) as count')
            ->where('status', 'A')
            ->where('created_date IS NOT NULL')
            ->groupBy('month')
            ->findAll();
---
SELECT MONTH(created_date) as month, COUNT(*) as count
FROM `customer`
WHERE `status` = 'A'
AND `created_date` IS NOT NULL
GROUP BY `month`

        }

        // Toplam kayıt sayısını hesaplıyoruz
        $totalCount = $customerModel->where('status', 'A')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `customer`
WHERE `status` = 'A'