app/Controllers/GrafikController.php

    public function index()
    {
        // UserModel'den isimleri alıyoruz
        $userModel = new UserModel();
        $users = $userModel->findAll();

        // CustomerModel'den ekleyen_id'ye göre gruplandırarak kayıt sayısını alıyoruz
        $customerModel = new CustomerModel();
        $customerCounts = $customerModel->select('ekleyen_id, COUNT(*) as count')
            ->groupBy('ekleyen_id')
            ->findAll();
---
SELECT `ekleyen_id`, COUNT(*) as count
FROM `customer`
GROUP BY `ekleyen_id`