app/Controllers/Home.php

SELECT *
FROM `customer`
ORDER BY `id` DESC
---
    public function index()
    {
   // Modeli yükleyelim
$model = new \App\Models\CustomerModel();

// Veritabanından id'ye göre büyükten küçüğe sıralı verileri alalım
$customers = $model->orderBy('id', 'DESC')->findAll(); // DESC ile büyükten küçüğe sıralama