app/Controllers/Home.php

    public function index()
    {
        // Modeli yükleyelim
        $model = new \App\Models\CustomerModel();

        // Veritabanından id'ye göre büyükten küçüğe sıralı verileri alalım
        $customers = $model->where('status', 'A')->orderBy('id', 'DESC')->findAll(); // DESC ile büyükten küçüğe sıralama
---
SELECT *
FROM `customer`
WHERE `status` = 'A'
ORDER BY `id` DESC

    public function silinenler()
    {
        // Modeli yükleyelim
        $model = new \App\Models\CustomerModel();

        // Veritabanından id'ye göre büyükten küçüğe sıralı verileri alalım
        $customers = $model->where('status', 'P')->orderBy('id', 'DESC')->findAll(); // DESC ile büyükten küçüğe sıralama
---
SELECT *
FROM `customer`
WHERE `status` = 'P'
ORDER BY `id` DESC

    public function tckarsilastir()
    {
        $input = $this->request->getPost('tc_list');
        $tcler = explode("\n", $input);

        // Boşlukları temizle, boşları at
        $tcler = array_filter(array_map('trim', $tcler));

        $kisilerModel = new \App\Models\CustomerModel();

        $dbTcler = $kisilerModel
            ->whereIn('tc', $tcler)
            ->findAll();
---
SELECT *
FROM `customer`
WHERE `tc` IN ('27239402436','60421297090')